artifacts/results.log
aiohttp-app
benchmark [0 ms]:
Running 1m test @ http://localhost:8080/?delay=0
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    77.29ms   43.31ms 294.88ms   65.91%
    Req/Sec     1.10k   369.46     3.74k    71.47%
  786155 requests in 1.00m, 122.96MB read
Requests/sec:  13084.33
Transfer/sec:      2.05MB
------------------------------------------

benchmark [20 ms]:
Running 1m test @ http://localhost:8080/?delay=20
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    73.30ms   36.74ms 268.38ms   72.30%
    Req/Sec     0.89k   208.48     1.57k    68.80%
  640898 requests in 1.00m, 100.24MB read
Requests/sec:  10664.34
Transfer/sec:      1.67MB
------------------------------------------

benchmark [40 ms]:
Running 1m test @ http://localhost:8080/?delay=40
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    62.74ms   18.54ms 165.77ms   65.34%
    Req/Sec   810.28    107.17     1.28k    71.85%
  581296 requests in 1.00m, 90.92MB read
Requests/sec:   9674.77
Transfer/sec:      1.51MB
------------------------------------------

benchmark [60 ms]:
Running 1m test @ http://localhost:8080/?delay=60
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    64.23ms    4.97ms 192.89ms   92.44%
    Req/Sec   668.54     93.49   838.00     74.55%
  479112 requests in 1.00m, 74.93MB read
Requests/sec:   7973.21
Transfer/sec:      1.25MB
------------------------------------------

benchmark [80 ms]:
Running 1m test @ http://localhost:8080/?delay=80
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    85.75ms   10.26ms 239.16ms   90.67%
    Req/Sec   501.76    135.59   838.00     67.84%
  359391 requests in 1.00m, 56.21MB read
Requests/sec:   5980.89
Transfer/sec:      0.94MB
------------------------------------------

benchmark [100 ms]:
Running 1m test @ http://localhost:8080/?delay=100
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   112.50ms   20.07ms 269.52ms   85.92%
    Req/Sec   392.29    145.48   828.00     68.32%
  280648 requests in 1.00m, 43.89MB read
Requests/sec:   4670.49
Transfer/sec:    748.01KB
------------------------------------------

benchmark [150 ms]:
Running 1m test @ http://localhost:8080/?delay=150
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   156.98ms   12.87ms 274.86ms   90.09%
    Req/Sec   274.06    157.01   828.00     66.71%
  194264 requests in 1.00m, 30.38MB read
Requests/sec:   3232.80
Transfer/sec:    517.75KB
------------------------------------------

benchmark [200 ms]:
Running 1m test @ http://localhost:8080/?delay=200
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   203.87ms    8.19ms 331.72ms   95.10%
    Req/Sec   230.94    189.94   828.00     68.41%
  147306 requests in 1.00m, 23.04MB read
Requests/sec:   2451.15
Transfer/sec:    392.57KB
------------------------------------------

benchmark [300 ms]:
Running 1m test @ http://localhost:8080/?delay=300
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   305.45ms   10.70ms 440.98ms   95.19%
    Req/Sec   219.38    205.58   810.00     71.39%
  98349 requests in 1.00m, 15.38MB read
Requests/sec:   1636.42
Transfer/sec:    262.08KB
------------------------------------------

benchmark [400 ms]:
Running 1m test @ http://localhost:8080/?delay=400
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   404.89ms    8.25ms 510.11ms   95.55%
    Req/Sec   200.11    193.58   820.00     78.33%
  73495 requests in 1.00m, 11.49MB read
Requests/sec:   1223.20
Transfer/sec:    195.90KB
------------------------------------------

==========================================


catacumba-app
benchmark [0 ms]:
Running 1m test @ http://localhost:8080/?delay=0
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    34.96ms   30.03ms 965.51ms   91.57%
    Req/Sec     2.58k   370.05     5.92k    88.60%
  1846723 requests in 1.00m, 158.51MB read
  Non-2xx or 3xx responses: 1
Requests/sec:  30736.96
Transfer/sec:      2.64MB
------------------------------------------

benchmark [20 ms]:
Running 1m test @ http://localhost:8080/?delay=20
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    21.76ms    3.59ms  82.08ms   93.40%
    Req/Sec     1.99k   168.51     2.33k    82.47%
  1427905 requests in 1.00m, 122.56MB read
Requests/sec:  23764.93
Transfer/sec:      2.04MB
------------------------------------------

benchmark [40 ms]:
Running 1m test @ http://localhost:8080/?delay=40
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    45.72ms   11.20ms 144.17ms   86.99%
    Req/Sec     0.97k   137.40     1.44k    73.24%
  694040 requests in 1.00m, 59.57MB read
Requests/sec:  11551.72
Transfer/sec:      0.99MB
------------------------------------------

benchmark [60 ms]:
Running 1m test @ http://localhost:8080/?delay=60
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    63.14ms    6.65ms 157.78ms   89.74%
    Req/Sec   674.34     97.29   838.00     73.89%
  483263 requests in 1.00m, 41.48MB read
Requests/sec:   8041.16
Transfer/sec:    706.74KB
------------------------------------------

benchmark [80 ms]:
Running 1m test @ http://localhost:8080/?delay=80
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    82.18ms    5.08ms 149.87ms   92.31%
    Req/Sec   512.51    139.30   838.00     70.61%
  366920 requests in 1.00m, 31.49MB read
Requests/sec:   6107.12
Transfer/sec:    536.76KB
------------------------------------------

benchmark [100 ms]:
Running 1m test @ http://localhost:8080/?delay=100
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   102.25ms    4.64ms 335.30ms   92.14%
    Req/Sec   410.67    165.05   828.00     66.15%
  293637 requests in 1.00m, 25.20MB read
Requests/sec:   4888.00
Transfer/sec:    429.61KB
------------------------------------------

benchmark [150 ms]:
Running 1m test @ http://localhost:8080/?delay=150
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   153.07ms   15.01ms 428.61ms   97.29%
    Req/Sec   279.44    164.10   828.00     65.86%
  196780 requests in 1.00m, 16.89MB read
Requests/sec:   3274.42
Transfer/sec:    287.79KB
------------------------------------------

benchmark [200 ms]:
Running 1m test @ http://localhost:8080/?delay=200
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   202.27ms    5.76ms 279.76ms   95.21%
    Req/Sec   239.29    226.34   828.00     74.30%
  148221 requests in 1.00m, 12.72MB read
Requests/sec:   2466.82
Transfer/sec:    216.81KB
------------------------------------------

benchmark [300 ms]:
Running 1m test @ http://localhost:8080/?delay=300
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   302.13ms    5.79ms 390.76ms   95.60%
    Req/Sec   170.76    169.23   818.00     80.74%
  98109 requests in 1.00m, 8.42MB read
Requests/sec:   1633.81
Transfer/sec:    143.60KB
------------------------------------------

benchmark [400 ms]:
Running 1m test @ http://localhost:8080/?delay=400
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   402.47ms    6.17ms 608.17ms   95.08%
    Req/Sec   153.32    150.03   808.00     80.93%
  73424 requests in 1.00m, 6.30MB read
Requests/sec:   1221.91
Transfer/sec:    107.39KB
------------------------------------------

==========================================


flask-app
benchmark [0 ms]:
Running 1m test @ http://localhost:8080/?delay=0
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   111.64ms  132.68ms   1.99s    96.28%
    Req/Sec    97.81    131.25     1.13k    93.16%
  41315 requests in 1.00m, 6.78MB read
  Socket errors: connect 0, read 12, write 0, timeout 594
Requests/sec:    687.52
Transfer/sec:    115.48KB
------------------------------------------

benchmark [20 ms]:
Running 1m test @ http://localhost:8080/?delay=20
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   463.32ms  125.65ms   1.86s    85.36%
    Req/Sec    34.48     25.17   181.00     70.67%
  16953 requests in 1.00m, 2.78MB read
  Socket errors: connect 0, read 119, write 0, timeout 40
Requests/sec:    282.09
Transfer/sec:     47.38KB
------------------------------------------

benchmark [40 ms]:
Running 1m test @ http://localhost:8080/?delay=40
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   844.15ms  190.72ms   1.99s    91.06%
    Req/Sec    20.03     15.33   111.00     74.01%
  9425 requests in 1.00m, 1.55MB read
  Socket errors: connect 0, read 59, write 0, timeout 70
Requests/sec:    156.83
Transfer/sec:     26.34KB
------------------------------------------

benchmark [60 ms]:
Running 1m test @ http://localhost:8080/?delay=60
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.09s   160.81ms   2.00s    85.91%
    Req/Sec    19.65     16.04   130.00     72.81%
  7092 requests in 1.00m, 1.16MB read
  Socket errors: connect 0, read 159, write 0, timeout 130
Requests/sec:    118.02
Transfer/sec:     19.82KB
------------------------------------------

benchmark [80 ms]:
Running 1m test @ http://localhost:8080/?delay=80
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.35s   127.91ms   1.97s    62.61%
    Req/Sec    18.62     14.86    90.00     72.33%
  3636 requests in 1.00m, 610.73KB read
  Socket errors: connect 0, read 38, write 0, timeout 199
Requests/sec:     60.50
Transfer/sec:     10.16KB
------------------------------------------

benchmark [100 ms]:
Running 1m test @ http://localhost:8080/?delay=100
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.42s   405.27ms   2.00s    42.08%
    Req/Sec    17.21     14.27    80.00     80.33%
  2752 requests in 1.00m, 462.25KB read
  Socket errors: connect 0, read 0, write 0, timeout 699
Requests/sec:     45.79
Transfer/sec:      7.69KB
------------------------------------------

benchmark [150 ms]:
Running 1m test @ http://localhost:8080/?delay=150
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.56s    60.01ms   1.96s    90.65%
    Req/Sec    11.58     11.07    80.00     85.28%
  1975 requests in 1.00m, 331.74KB read
  Socket errors: connect 0, read 18, write 0, timeout 1376
Requests/sec:     32.86
Transfer/sec:      5.52KB
------------------------------------------

benchmark [200 ms]:
Running 1m test @ http://localhost:8080/?delay=200
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.77s    50.74ms   1.98s    50.37%
    Req/Sec    11.19      9.90    60.00     77.92%
  1446 requests in 1.00m, 242.88KB read
  Socket errors: connect 0, read 68, write 0, timeout 1045
Requests/sec:     24.06
Transfer/sec:      4.04KB
------------------------------------------

benchmark [300 ms]:
Running 1m test @ http://localhost:8080/?delay=300
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us    -nan%
    Req/Sec     7.86     10.57    70.00     90.52%
  954 requests in 1.00m, 160.24KB read
  Socket errors: connect 0, read 12, write 0, timeout 954
Requests/sec:     15.88
Transfer/sec:      2.67KB
------------------------------------------

benchmark [400 ms]:
Running 1m test @ http://localhost:8080/?delay=400
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us    -nan%
    Req/Sec     8.91      9.26    40.00     81.86%
  727 requests in 1.00m, 122.11KB read
  Socket errors: connect 0, read 10, write 0, timeout 727
Requests/sec:     12.10
Transfer/sec:      2.03KB
------------------------------------------

==========================================


luminus-app
benchmark [0 ms]:
Running 1m test @ http://localhost:8080/?delay=0
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    94.16ms  133.16ms   1.58s    97.87%
    Req/Sec     1.09k   159.41     2.13k    86.47%
  732819 requests in 1.00m, 248.80MB read
  Socket errors: connect 0, read 0, write 0, timeout 996
Requests/sec:  12193.31
Transfer/sec:      4.14MB
------------------------------------------

benchmark [20 ms]:
Running 1m test @ http://localhost:8080/?delay=20
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   656.07ms   69.05ms 870.55ms   87.67%
    Req/Sec   154.92    154.78   830.00     81.26%
  87133 requests in 1.00m, 29.58MB read
Requests/sec:   1450.58
Transfer/sec:    504.30KB
------------------------------------------

benchmark [40 ms]:
Running 1m test @ http://localhost:8080/?delay=40
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.27s   126.84ms   1.46s    89.29%
    Req/Sec   110.80    121.54   707.00     83.82%
  45021 requests in 1.00m, 15.28MB read
Requests/sec:    749.15
Transfer/sec:    260.45KB
------------------------------------------

benchmark [60 ms]:
Running 1m test @ http://localhost:8080/?delay=60
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.83s   216.08ms   2.00s    95.33%
    Req/Sec    76.82     70.75   414.00     73.59%
  30700 requests in 1.00m, 10.42MB read
  Socket errors: connect 0, read 0, write 0, timeout 1901
Requests/sec:    510.86
Transfer/sec:    177.60KB
------------------------------------------

benchmark [80 ms]:
Running 1m test @ http://localhost:8080/?delay=80
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.14s   487.08ms   2.00s    66.95%
    Req/Sec    66.34     70.26   555.00     82.77%
  23237 requests in 1.00m, 7.89MB read
  Socket errors: connect 0, read 0, write 0, timeout 22078
Requests/sec:    386.65
Transfer/sec:    134.42KB
------------------------------------------

benchmark [100 ms]:
Running 1m test @ http://localhost:8080/?delay=100
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.31s   596.95ms   1.96s    72.41%
    Req/Sec    57.51     62.56   342.00     86.50%
  18702 requests in 1.00m, 6.35MB read
  Socket errors: connect 0, read 0, write 0, timeout 17774
Requests/sec:    311.20
Transfer/sec:    108.19KB
------------------------------------------

benchmark [150 ms]:
Running 1m test @ http://localhost:8080/?delay=150
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.05s   560.42ms   1.96s    53.85%
    Req/Sec    73.55     65.84   323.00     71.29%
  12557 requests in 1.00m, 4.26MB read
  Socket errors: connect 0, read 0, write 0, timeout 12141
Requests/sec:    208.95
Transfer/sec:     72.64KB
------------------------------------------

benchmark [200 ms]:
Running 1m test @ http://localhost:8080/?delay=200
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.01s   518.46ms   1.82s    55.56%
    Req/Sec    43.71     50.13   300.00     87.05%
  9450 requests in 1.00m, 3.21MB read
  Socket errors: connect 0, read 0, write 0, timeout 9162
Requests/sec:    157.24
Transfer/sec:     54.67KB
------------------------------------------

benchmark [300 ms]:
Running 1m test @ http://localhost:8080/?delay=300
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.27s   349.65ms   1.96s    48.85%
    Req/Sec    31.64     35.29   290.00     86.58%
  6251 requests in 1.00m, 2.12MB read
  Socket errors: connect 0, read 0, write 0, timeout 6120
Requests/sec:    104.01
Transfer/sec:     36.16KB
------------------------------------------

benchmark [400 ms]:
Running 1m test @ http://localhost:8080/?delay=400
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us    -nan%
    Req/Sec    39.28     33.27   181.00     78.85%
  4471 requests in 1.00m, 1.52MB read
  Socket errors: connect 0, read 0, write 0, timeout 4471
Requests/sec:     74.40
Transfer/sec:     25.87KB
------------------------------------------

==========================================


yada-app
benchmark [0 ms]:
Running 1m test @ http://localhost:8080/?delay=0
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   151.23ms  235.77ms   1.99s    88.18%
    Req/Sec   750.00    288.08     2.09k    71.45%
  532697 requests in 1.00m, 128.68MB read
  Socket errors: connect 0, read 0, write 0, timeout 658
  Non-2xx or 3xx responses: 243
Requests/sec:   8867.34
Transfer/sec:      2.14MB
------------------------------------------

benchmark [20 ms]:
Running 1m test @ http://localhost:8080/?delay=20
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    95.46ms   73.48ms   1.24s    87.96%
    Req/Sec   684.76    112.52     1.24k    70.43%
  490900 requests in 1.00m, 118.57MB read
  Non-2xx or 3xx responses: 247
Requests/sec:   8168.19
Transfer/sec:      1.97MB
------------------------------------------

benchmark [40 ms]:
Running 1m test @ http://localhost:8080/?delay=40
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    85.57ms   36.08ms 332.23ms   68.18%
    Req/Sec   660.71     86.00     0.91k    70.26%
  473230 requests in 1.00m, 114.18MB read
Requests/sec:   7876.28
Transfer/sec:      1.90MB
------------------------------------------

benchmark [60 ms]:
Running 1m test @ http://localhost:8080/?delay=60
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    74.76ms   16.07ms 403.64ms   87.49%
    Req/Sec   613.43     75.50   800.00     76.63%
  439162 requests in 1.00m, 105.96MB read
  Non-2xx or 3xx responses: 1
Requests/sec:   7307.41
Transfer/sec:      1.76MB
------------------------------------------

benchmark [80 ms]:
Running 1m test @ http://localhost:8080/?delay=80
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   138.44ms   44.64ms 289.34ms   57.28%
    Req/Sec   304.06    122.39   760.00     66.87%
  216996 requests in 1.00m, 52.52MB read
  Non-2xx or 3xx responses: 262
Requests/sec:   3610.94
Transfer/sec:      0.87MB
------------------------------------------

benchmark [100 ms]:
Running 1m test @ http://localhost:8080/?delay=100
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   183.87ms   48.64ms 374.49ms   61.64%
    Req/Sec   264.57    125.89   797.00     63.92%
  187642 requests in 1.00m, 45.32MB read
  Non-2xx or 3xx responses: 100
Requests/sec:   3122.66
Transfer/sec:    772.35KB
------------------------------------------

benchmark [150 ms]:
Running 1m test @ http://localhost:8080/?delay=150
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   215.29ms   50.19ms 373.30ms   57.55%
    Req/Sec   197.76    108.72   760.00     64.67%
  139544 requests in 1.00m, 33.76MB read
  Non-2xx or 3xx responses: 127
Requests/sec:   2322.91
Transfer/sec:    575.52KB
------------------------------------------

benchmark [200 ms]:
Running 1m test @ http://localhost:8080/?delay=200
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   252.99ms   50.26ms 442.23ms   66.37%
    Req/Sec   157.65     94.57   585.00     69.87%
  111637 requests in 1.00m, 26.94MB read
  Non-2xx or 3xx responses: 79
Requests/sec:   1858.29
Transfer/sec:    459.20KB
------------------------------------------

benchmark [300 ms]:
Running 1m test @ http://localhost:8080/?delay=300
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   323.10ms   42.83ms 828.54ms   88.66%
    Req/Sec   126.87     61.73   515.00     70.65%
  89643 requests in 1.00m, 21.65MB read
  Non-2xx or 3xx responses: 58
Requests/sec:   1491.97
Transfer/sec:    369.05KB
------------------------------------------

benchmark [400 ms]:
Running 1m test @ http://localhost:8080/?delay=400
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   410.37ms   18.25ms 584.10ms   89.59%
    Req/Sec   115.77     94.21   790.00     65.38%
  72981 requests in 1.00m, 17.61MB read
Requests/sec:   1214.73
Transfer/sec:    300.12KB
------------------------------------------

==========================================